//休息了两天，马上要断电了，赶紧在写一个题目！


//企业发放的奖金根据利润I提成。
//
//利润I低于或等于100000元的，奖金可提10%;
//利润高于100000元，低于或等于200000元（100000<I≤200000）时，低于等于100000元部分按10％提成，高于100000元的部分，可提成 7.5%;
//200000<I≤400000时，低于200000元部分仍按上述办法提成（下同），高于200000元的部分按5％提成；
//400000<I≤600000元时，高于400000元的部分按3％提成；
//
//600000<I≤1000000时，高于600000元的部分按1.5%提成；
//I>1000000时，超过1000000元的部分按1%提成。
//
//从键盘输入当月利润I,求应发奖金总数。

#include<stdio.h>
int main()
{
    int i,r;
    const int B=100000;
    scanf("%d",&i);
    if(i<=B)//利润少于或等于100000
    {
        r=i*0.1;
    }
    else if(i>B&&i<=(2*B))  //利润高于100000，低于或等于200000
    {
        r=0.1*B+(i-B)*0.075;
    }
    else if(i>(2*B)&&i<=(4*B))//利润高于200000，低于或等于400000
    {
        r=0.1*B+0.075*B+(i-2*B)*0.05;
    }
    else if(i>(4*B)&&i<=(6*B))  //利润高于400000，低于或等于600000
    {
        r=0.1*B+0.075*B+0.05*2*B+(i-4*B)*0.03;
    }
    else if(i>(6*B)&&i<=(10*B)) //利润高于600000，低于或等于1000000
    {
        r=0.1*B+0.075*B+0.05*2*B+0.03*2*B+(i-6*B)*0.015;
    }
    else if(i>(10*B))//利润高于1000000
    {
        r=0.1*B+0.075*B+0.05*2*B+0.03*2*B+0.03*2*B+4*B*0.015+((i-10*B)*0.01);
    }
    printf("%d",r);
    return 0;

}