/*
 * 给定M行N列的矩阵A
 * 如果A的非边界元素A[i][j]大于相邻的上下左右4个元素，则A[i][j]为局部极大值
 * 本题要求给定矩阵的全部极大值及其所在的位置
 *
 * 输入：
 *      在第一行中给出矩阵A的行数列数MN(3<=M,N<=20),
 *      最后M行，每行给出A在改行的N个元素，数字间以空格分隔
 * 输出：
 *      每行按照“元素值 行号 列号“的格式输出一个局部极大值，其中行列编号从1开始
 *      要求按照行号递增输出
 *      若同行有超过1个局部极大值，则该行按列号递增输出
 *      若没有局部极大值，则输出“None 总行数 总列数”
*/

#include<stdio.h>
int main()
{
    int i,j,a[3][20]={0},n,m,count = 0;
    scanf("%d %d",&n,&m);
    for(i=0;i<n;i++)
    {
        for(j=0;j<m;j++)
        {
            scanf("%d",&a[i][j]);
        }
    }

    for(i=1;i<n-1;i++)
    {
        for(j=1;j<m-1;j++)
        {
            if(a[i][j]>a[i-1][j] && a[i][j]>a[i+1][j] && a[i][j]>a[i][j-1] && a[i][j]>a[i][j-1])
            {
                printf("%d %d %d\n",a[i][j],i+1,j+1);
                count++;
            }
        }
    }
    if(count == 0)
        printf("None %d %d",n,m);
    return 0;
}